//
//  GradeMapperApp.swift
//  Shared
//
//  Created by Иван Бущик on 17.01.2022.
//

import SwiftUI

class helpMe{
	var multiplier: Double
	var subjectName: String
	var subjectSubName: String
	var grade: Int
	var sum: Double
	var sr: Double
	var gradesWeighted: Double = 0
	var weightsSum: Double = 0
	var history: [Int]
	init(){
		self.multiplier = 1.5
		self.subjectName = "Русский язык"
		self.subjectSubName = "Контрольная работа"
		self.gradesWeighted = 0
		self.weightsSum = 0
		self.sr = 0
		self.sum = 0
		self.grade = 0
		self.history = []
	}
	func set(n1: String, n2: String) -> Void{
		self.multiplier = subjects[n1]![n2]!
		self.subjectName = n1
		self.subjectSubName = n2
	}
	func setGrade(grade: Int){
		self.grade = grade
	}
	
}


@main
struct GradeMapperApp: App {
	var body: some Scene {
		WindowGroup {
			ContentView()
		}
	}
}

var subjects: [String : [String : Double]] = [
	"Русский язык": [
		"Контрольная работа": 1.5,
		"Контрольный диктант": 1.5,
		"Административная контрольная работа": 1.5,
		"Словарный диктант": 1.4,
		"Домашнее сочинение": 1.4,
		"Изложение": 1.4,
		"Проверочная работа": 1.3,
		"Самостоятельная работа": 1.2,
		"Работа на уроке": 1.0,
		"Тест": 1.0,
		"Сочинение": 1.0,
		"Домашняя работа": 1.0
	], "Литература": [
		"Контрольная работа": 1.5,
		"Классное сочинение": 1.5,
		"Домашнее сочинение": 1.4,
		"Проверочная работа": 1.3,
		"Самостоятельная работа": 1.2,
		"Работа на уроке": 1.0,
		"Тест": 1.0,
		"Сочинение": 1.0,
		"Домашняя работа": 1.0
	], "Алгебрa": [
		"Контрольная работа": 1.5,
		"Административная контрольная работа": 1.5,
		"Контрольная практическая работа": 1.5,
		"Зачёт": 1.5,
		"Проверочная работа": 1.3,
		"Самостоятельная работа": 1.2,
		"Работа на уроке": 1.0,
		"Домашняя работа": 1.0
	], "Геометрия": [
		"Контрольная работа": 1.5,
		"Административная контрольная работа": 1.5,
		"Контрольная практическая работа": 1.5,
		"Зачёт": 1.5,
		"Проверочная работа": 1.3,
		"Практическая работа": 1.3,
		"Самостоятельная работа": 1.2,
		"Работа на уроке": 1.0,
		"Домашняя работа": 1.0
	], "Физика": [
		"Контрольная работа": 1.5,
		"Зачёт": 1.5,
		"Проверочная работа": 1.3,
		"Практическая работа": 1.3,
		"Срезовая работа": 1.3,
		"Лабораторная работа": 1.3,
		"Самостоятельная работа": 1.2,
		"Работа на уроке": 1.0,
		"Тест": 1.0,
		"Домашняя работа": 1.0
	], "Информатика": [
		"Контрольная работа": 1.5,
		"Зачёт": 1.5,
		"Проверочная работа": 1.3,
		"Практическая работа": 1.3,
		"Самостоятельная работа": 1.2,
		"Работа на уроке": 1.0,
		"Домашняя работа": 1.0
	]
]

var subjectsNames: [String] = [String](subjects.keys)
