//
//  GradeMapperApp.swift
//  Shared
//
//  Created by Иван Бущик on 17.01.2022.
//

import SwiftUI

class counters{
	var multiplier: Double
	var gradesWeighted: Double = 0
	var weightsSum: Double = 0
	init(){
		self.multiplier = 1.0
		self.gradesWeighted = 0
		self.weightsSum = 0
	}
}

@main
struct GradeMapperApp: App {
	var body: some Scene {
		WindowGroup {
			ContentView()
		}
	}
}

var coof = [
	"Работа на уроке": 1.0,
	"Тест": 1.0,
	"Чтение наизусть": 1.0,
	"Сочинение": 1.0,
	"Дистанционный урок": 1.0,
	"Электронное обучение": 1.0,
	"Ведение тетради": 1.0,
	"Викторина": 1.0,
	"Работа над ошибками": 1.0,
	"Самостоятельная работа": 1.2,
	"Проверочная работа": 1.3,
	"Практическая работа": 1.3,
	"Лабораторная работа": 1.3,
	"Срезовая работа": 1.3,
	"Словарный диктант": 1.4,
	"Домашнее сочинение": 1.4,
	"Аудирование": 1.4,
	"Изложение": 1.4,
	"Контрольная работа": 1.5,
	"Контрольный диктант": 1.5,
	"Контрольная практическая работа": 1.5,
	"Административная к.р.": 1.5,
	"Зачёт": 1.5,
	"Классное сочинение": 1.5
]
